/// <reference types="Cypress" />

/* ******************************************************************************** */
// Données de test
/* ******************************************************************************** */
// URL de base du site
let BASE_URL = 'http://aaaaaaaaaaaaaaaaa';

/* ******************************************************************************** */
// Suite de test : User Story S01 - aaaaaaaaaaaaaaaaa
/* ******************************************************************************** */
describe('S01 - aaaaaaaaaaaaaaaaa', () => {

  /* -------------------------------------------------------------------------------- */
  // S01 - Etapes communes à tous les cas de test
  /* -------------------------------------------------------------------------------- */
  beforeEach(() => {
    // Ici la création de compte est commune aux deux tests
    // Étape 1 : Aller sur le site
    cy.visit(BASE_URL);
  });

  /* -------------------------------------------------------------------------------- */
  // S01 - Cas PASSANT : aaaaaaaaaaaaaaaaa
  /* -------------------------------------------------------------------------------- */
  it('Cas PASSANT : aaaaaaaaaaaaaaaaa', () => {
    // --- ETAPES ----
    // Etape 2 : 

    // --- ASSERTIONS ---

  })

  /* -------------------------------------------------------------------------------- */
  // S01 - Cas NON PASSANT : aaaaaaaaaaaaaaaaa
  /* -------------------------------------------------------------------------------- */
  it.only('Cas NON PASSANT : aaaaaaaaaaaaaaaaa', () => {
    // --- ETAPES ----
    // Etape 2 : 

    // --- ASSERTIONS ---

  })
});